
## Plan Result (stg)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "opal-service-auth-provider-stg"
      + tags     = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-service-auth-provider-app.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "opal-service-auth-provider-appinsights-stg"
      + resource_group_name                   = "opal-service-auth-provider-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-service-auth-provider-app.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - opal-service-auth-provider-appinsights-stg"
      + resource_group_name = "opal-service-auth-provider-stg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-service-auth-provider-app.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C061Z4DJM47"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":4,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->